DMS_trips/app/controllers/flights_controller.rb

	def show
		#Searching departure flights
		if params[:origin] && params[:destination] && params[:from_date]
		@a = params[:from_date].map{|key,value| value}
		@date=Date.new(@a[0].to_i,@a[1].to_i,@a[2].to_i)

		@flights = Flight.search(params[:origin], params[:destination], @date )
---
SELECT "flights".* FROM "flights"  WHERE (origin like '%Madrid%') AND (destination like '%Paris%') AND (from_date like '%2014-11-06%')