DMS_trips/app/controllers/staticpages_controller.rb

SELECT "flights".* FROM "flights"
---
	def json
		@flights=Flight.all